// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

{Console.WriteLine("Введите 3 числа:");
    
    int a, b, c;
    a = Convert.ToInt32(Console.ReadLine());
    b = Convert.ToInt32(Console.ReadLine());
    c = Convert.ToInt32(Console.ReadLine());
   
{
    if (b > a)
    Console.Write("{0} наибольшее число", b);      
    
    else

    if (c > b)
    Console.Write("{0} наибольшее число", c);
    }
}